<template>
  <section>
    <div class="bg-white px-6 rounded-xl">
      <BaseTable
        :data="tableData"
        :head="tableHead()"
        :loading="loading"
        :title="$t('notification.title')"
        :subtitle="$t('notification.count', { count: paginationData.total })"
        :total="paginationData.total"
        :filter="{ status }"
        v-bind="tableSettings()"
      >
        <template #id="{ data }">
          <div class="flex items-center gap-1">
            <span class="text-sm font-medium text-dark-black">
              {{ data?.id }}
              <i class="icon-copy text-primary font-semibold" />
            </span>
          </div>
        </template>

        <template #date="{ data }">
          <DateTime :date="data?.date" :time="data?.date" />
        </template>

        <template #body="{ data }">
          <p>💳 {{ data?.body }}</p>
        </template>

        <template #filter>
          <div class="flex gap-5">
            <FormFilterLabel :label="$t('interval_of_time')">
              <FilterDateRange
                class="bg-white"
                start-date-key="created_at__gte"
                end-date-key="created_at__lte"
              />
            </FormFilterLabel>
          </div>
        </template>
      </BaseTable>
    </div>
  </section>
</template>

<script lang="ts" setup>
import { useRouteQuery } from "@vueuse/router";
import { ref } from "vue";

import { BaseTable } from "@/components/Base";
import FilterDateRange from "@/components/Base/Form/DatePicker/FilterDateRange.vue";
import FormFilterLabel from "@/components/Base/Form/Label/FormFilterLabel.vue";
import {
  tableHead,
  tableSettings,
} from "@/modules/notification/data/PNotification";
import DateTime from "@/components/Common/DateTime.vue";
import { useI18n } from "vue-i18n";

const { t } = useI18n();

const status = useRouteQuery("status", t("statuses.all_statuses"));

const loading = ref(false);

const tableData = ref([
  {
    id: 37351,
    body: "Сбербанк Онлайн. Поступление средств. Сумма: 12 300 ₽. Отправитель: Иванов И.И. Назначение: Оплата по счёту №274 от 08.07.2025 .Дата и время: 10.07.2025, 14:36 (МСК). Сбербанк Онлайн. Поступление средств. Сумма: 12 300 ₽. Отправитель: Иванов И.И. Назначение: Оплата по счёту №274 от 08.07.2025 .Дата и время: 10.07.2025, 14:36 (МСК). ",
    date: "2025-07-17T10:30:00",
  },
  {
    id: 37351,
    body: "Сбербанк Онлайн. Поступление средств. Сумма: 12 300 ₽. Отправитель: Иванов И.И. Назначение: Оплата по счёту №274 от 08.07.2025 .Дата и время: 10.07.2025, 14:36 (МСК). Сбербанк Онлайн. Поступление средств. Сумма: 12 300 ₽. Отправитель: Иванов И.И. Назначение: Оплата по счёту №274 от 08.07.2025 .Дата и время: 10.07.2025, 14:36 (МСК). ",
    date: "2025-07-17T10:30:00",
  },
  {
    id: 37351,
    body: "Сбербанк Онлайн. Поступление средств. Сумма: 12 300 ₽. Отправитель: Иванов И.И. Назначение: Оплата по счёту №274 от 08.07.2025 .Дата и время: 10.07.2025, 14:36 (МСК). Сбербанк Онлайн. Поступление средств. Сумма: 12 300 ₽. Отправитель: Иванов И.И. Назначение: Оплата по счёту №274 от 08.07.2025 .Дата и время: 10.07.2025, 14:36 (МСК). ",
    date: "2025-07-17T10:30:00",
  },
  {
    id: 37351,
    body: "Сбербанк Онлайн. Поступление средств. Сумма: 12 300 ₽. Отправитель: Иванов И.И. Назначение: Оплата по счёту №274 от 08.07.2025 .Дата и время: 10.07.2025, 14:36 (МСК). Сбербанк Онлайн. Поступление средств. Сумма: 12 300 ₽. Отправитель: Иванов И.И. Назначение: Оплата по счёту №274 от 08.07.2025 .Дата и время: 10.07.2025, 14:36 (МСК). ",
    date: "2025-07-17T10:30:00",
  },
  {
    id: 37351,
    body: "Сбербанк Онлайн. Поступление средств. Сумма: 12 300 ₽. Отправитель: Иванов И.И. Назначение: Оплата по счёту №274 от 08.07.2025 .Дата и время: 10.07.2025, 14:36 (МСК). Сбербанк Онлайн. Поступление средств. Сумма: 12 300 ₽. Отправитель: Иванов И.И. Назначение: Оплата по счёту №274 от 08.07.2025 .Дата и время: 10.07.2025, 14:36 (МСК). ",
    date: "2025-07-17T10:30:00",
  },
  {
    id: 37351,
    body: "Сбербанк Онлайн. Поступление средств. Сумма: 12 300 ₽. Отправитель: Иванов И.И. Назначение: Оплата по счёту №274 от 08.07.2025 .Дата и время: 10.07.2025, 14:36 (МСК). Сбербанк Онлайн. Поступление средств. Сумма: 12 300 ₽. Отправитель: Иванов И.И. Назначение: Оплата по счёту №274 от 08.07.2025 .Дата и время: 10.07.2025, 14:36 (МСК). ",
    date: "2025-07-17T10:30:00",
  },
  {
    id: 37351,
    body: "Сбербанк Онлайн. Поступление средств. Сумма: 12 300 ₽. Отправитель: Иванов И.И. Назначение: Оплата по счёту №274 от 08.07.2025 .Дата и время: 10.07.2025, 14:36 (МСК). Сбербанк Онлайн. Поступление средств. Сумма: 12 300 ₽. Отправитель: Иванов И.И. Назначение: Оплата по счёту №274 от 08.07.2025 .Дата и время: 10.07.2025, 14:36 (МСК). ",
    date: "2025-07-17T10:30:00",
  },
  {
    id: 37351,
    body: "Сбербанк Онлайн. Поступление средств. Сумма: 12 300 ₽. Отправитель: Иванов И.И. Назначение: Оплата по счёту №274 от 08.07.2025 .Дата и время: 10.07.2025, 14:36 (МСК). Сбербанк Онлайн. Поступление средств. Сумма: 12 300 ₽. Отправитель: Иванов И.И. Назначение: Оплата по счёту №274 от 08.07.2025 .Дата и время: 10.07.2025, 14:36 (МСК). ",
    date: "2025-07-17T10:30:00",
  },
  {
    id: 37351,
    body: "Сбербанк Онлайн. Поступление средств. Сумма: 12 300 ₽. Отправитель: Иванов И.И. Назначение: Оплата по счёту №274 от 08.07.2025 .Дата и время: 10.07.2025, 14:36 (МСК). Сбербанк Онлайн. Поступление средств. Сумма: 12 300 ₽. Отправитель: Иванов И.И. Назначение: Оплата по счёту №274 от 08.07.2025 .Дата и время: 10.07.2025, 14:36 (МСК). ",
    date: "2025-07-17T10:30:00",
  },
  {
    id: 37351,
    body: "Сбербанк Онлайн. Поступление средств. Сумма: 12 300 ₽. Отправитель: Иванов И.И. Назначение: Оплата по счёту №274 от 08.07.2025 .Дата и время: 10.07.2025, 14:36 (МСК). Сбербанк Онлайн. Поступление средств. Сумма: 12 300 ₽. Отправитель: Иванов И.И. Назначение: Оплата по счёту №274 от 08.07.2025 .Дата и время: 10.07.2025, 14:36 (МСК). ",
    date: "2025-07-17T10:30:00",
  },
]);

const paginationData = ref({
  total: tableData.value.length,
});
</script>

<style scoped></style>
